---
kind: property
id: P:Autodesk.Revit.UI.UIThemeManager.DefaultTheme
source: html/f0af2408-0d16-4ed6-5eac-ce9d63d221c9.htm
---
# Autodesk.Revit.UI.UIThemeManager.DefaultTheme Property

The default theme.

## Syntax (C#)
```csharp
[ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit the replacement is CurrentTheme property.")]
public static UITheme DefaultTheme { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration